package moe.ono.config;

import java.util.Random;

public class DailySaying {
    public static String getSaying() {
        String content = "有你在的日子才是我的日常。\n" +
                "夹在我女友与前女友与青梅竹马间的果然是修罗场！\n" +
                "既然如此，就再努力一次吧。别在这里愁眉不展，也不要再自欺欺人，重新来过！\n" +
                "比自己,比梦想更重要的东西永远都存在着...\n" +
                "嘛，那又怎么样呢？\n" +
                "自身不先改变的话，一切都不会改变。\n" +
                "比起有一百个朋友，不如有个比一百人还要重要的真心朋友。\n" +
                "我有在反省，但我不后悔。\n" +
                "要超越过去与悲伤，用坚强和笑容去开拓明天。\n" +
                "男人许下的诺言就一定要遵守。\n" +
                "没有回忆就去创造回忆，没有道路就去开辟道路。\n" +
                "我敬你是条汉子！\n" +
                "不相信自己的人，连努力的价值都没有。\n" +
                "微风摇曳着窗帘，夕阳斜射入教室，在那里鼓起勇气告白的少年。即使现在也能清晰地回想起她的声音「当朋友，不行吗？」\n" +
                "就算是沉落地面的太阳，只要夜晚过了一定会再度升起，不管有什么痛苦或难过的事，跟今天截然不同的明天也一定会到来。\n" +
                "我的腿让我停下，可是心却不允许我那么做。\n" +
                "生活就像超级女生，走到最后的都是纯爷们。\n" +
                "我要拼，装上假牙也要拼！\n" +
                "想要成为无论多么悲伤的时候，也能够漂亮微笑的人吧。\n" +
                "人们只是用好人来称呼对自己有用的人而以，不存在对所有人都有用的人。\n" +
                "烈焰中舞动的火花，将赐予邪恶异性交往以天罚。\n" +
                "无论乌云有多浓厚，星星也一定还在，只是暂时看不到了而已。\n" +
                "不相信人咬不到肚脐的，咬破肚脐去死如何？\n" +
                "人一生会遇到约万人，两个人相爱的概率是.。所以你不爱我，我不怪你。\n" +
                "不管看到什么样的过去，都请不要迷失自己，不管你变成什么样子，我都是你的同伴。\n" +
                "心，可是很重的。\n" +
                "我爱上的人，称我为怪叔叔\n" +
                "慕君之心，至死方休。\n" +
                "虚伪的眼泪，会伤害别人，虚伪的笑容，会伤害自己。\n" +
                "世界は恋に落ちている。\n" +
                "若隐若现才是艺术！\n" +
                "生我何用？不能欢笑。灭我何用？不减狂骄。\n" +
                "就是因为你不好，才要留在你身边，给你幸福。\n" +
                "呐，我们好像是，被宇宙和地球拆散的恋人似的。\n" +
                "你会梦游，我会磨牙，我们晚上一起去吓人吧！\n" +
                "或许只需一滴露水，便能守护这绽放的花朵。\n" +
                "自己永远是孤单的，但你可以让其他人变得不孤单。\n" +
                "和哥哥的便当比起来夜空的薯片就像大便一样！只会给我大便的大便夜空是笨蛋～笨蛋～\n" +
                "我手中的魔法，是守护挚爱的力量，是坚定这个信念所必须的力量，我一定会拯救你的，无论在何时、何地。\n" +
                "要改变别人的心真是件很难办的事，不过改变自己要容易一点。\n" +
                "风筝的线你随时可以放开，只是别盼望我会回来。\n" +
                "Nothing is true, everything is permitted.\n" +
                "与你的生命等价的东西，这个世界上根本没有。\n" +
                "君子可寓意于物，但不可留意于物。\n" +
                "最好的感觉，是有人懂你的欲言又止。\n" +
                "看似美好的东西，往往藏着陷阱。\n" +
                "爱,其实很简单，困难的是去接受它。\n" +
                "喜欢大胸只是本能，喜欢贫乳才是审美。\n" +
                "二次元什么的我本来是不感冒的，直到我的膝盖中了一箭。\n" +
                "你才是⑨！你全家都是⑨！\n" +
                "努力是不会背叛自己的，虽然梦想有时会背叛自己。\n" +
                "面对就好，去经历就好。\n" +
                "我从小就害怕虫子\n" +
                "做不到的话，不过就是一死 。但是，赢了就能活下去，要是不战斗就赢不了。\n" +
                "既然认准这条路，何必去打听要走多久。\n" +
                "研表究明，汉字的序顺并不定一能影阅响读，比如当你看完这句话后，才发这现里的字全是都乱的。\n" +
                "少年心意，一如明月松间的青石流水，那些年里看到了，却不懂。\n" +
                "明明只是活着，哀伤却无处不在⋯⋯\n" +
                "少罗嗦，你还不如虫子呢！\n" +
                "天空是连着的，如果我们也能各自发光的话，无论距离有多远，都能看到彼此努力的身影。\n" +
                "别人恋爱不成功，你连暗恋都不成功！\n" +
                "H什么的最讨厌了！\n" +
                "如果你都不知道自己想去哪里，那去哪里都是一样的。\n" +
                "越是困难，越要抬起头，地上可找不到任何希望！\n" +
                "人与人在偶然之中创造相遇与别离。\n" +
                "所以，他们的祭典还没结束。\n" +
                "既不回头，何必不忘；既然无缘，何必誓言；今日种种，似水无痕。\n" +
                "正因为听不见和看不到，所以风子才会做这样的事情。\n" +
                "你为了你的正义，我为了我的正义。\n" +
                "可是就算我们通一千次短信，我们各自的心，大概也只会相互靠近一厘米吧。\n" +
                "用我一生，换你十年天真无邪。\n" +
                "不忘初心，方得始终。\n" +
                "我的终点，与幸福同在。\n" +
                "什么都无法舍弃的人，什么都无法改变 。\n" +
                "错的不是我， 错的是世界。\n" +
                "有些人，一旦遇见，便一眼万年；有些心动，一旦开始，便覆水难收。\n" +
                "有光的地方必有影，有影的地方也必定有光，绝望的颜色越是浓重，一定会有光芒耀眼的希望。\n" +
                "已经无法回到过去了。也不知道将来会是什么模样。\n" +
                "我知道的，面码⋯⋯自己已经死掉这点事，还是知道的⋯⋯\n" +
                "苦到头未必是甜的，而甜到头一定是苦的 。\n" +
                "文能提笔控萝莉，武能床上定人妻。进可欺身压正太，退能提臀迎众基。\n" +
                "就算只有六十亿分之一的机会，我们还是会邂逅。\n" +
                "无法飞翔的翅膀也是有意义的，因为它是曾经翱翔于天空所留下的珍贵回忆。\n" +
                "不会停的雨的确存在，但是撑起伞来就行了，接下来抬起头前进，这样一来，偶尔会出现下着太阳雨的日子，经过阳光的反射闪闪发亮的雨滴，一定非常美丽。\n" +
                "人总是会变的，不要害怕改变哦。\n" +
                "即使从梦中醒来，还会有回忆留下。\n" +
                "想了解喜欢的人，可是，却不能理解。\n" +
                "只要有想见面的人，自己就不再是孤单一人。\n" +
                "一定是红线下得太乱，才不小心把我和你绑在一起了……却没系稳。\n" +
                "挡着在我们面前的是巨大庞然的人生，阻隔在我们中间的是广阔无际的时间，对于他们，我们无能为力⋯⋯\n" +
                "这是眼泪吗？原来眼泪是这么的温暖，我一直以为，哀伤的东西都是冰冷的。\n" +
                "时间并不存在，存在的只有此刻。\n" +
                "梦想是否无聊并不是别人来决定的，不管是什么样的梦想，自己拼命努力去追寻才是最重要的。\n" +
                "等待，不是为了你能回来，而是找个借口不离开。\n" +
                "世界这么大，人生这么长，总会有那么一个人，让你想要温柔的对待。\n" +
                "嗯，一个人也要加油，我是坚强的孩子。\n" +
                "我想让自己强大起来，因为至少我已经有幸和想要保护的人相遇了。\n" +
                "老是低着头，幸福可是会离你而去的喔。\n" +
                "我觉得，我这辈子最灿烂的笑容，大概都奉献给我电脑屏幕了。\n" +
                "如果还有来生 ，我无论如何都要来到你身边，我已经没有了其他想要追求的东西，因为没有比你更重要的了。\n" +
                "将愿望倾入不愿忘却的回忆中⋯⋯\n" +
                "胸不平何以平天下，乳不巨何以聚人心。\n" +
                "你最无暇的时光是哪段，你又把它奉献给了谁？\n" +
                "男人变态有什么错！\n" +
                "失去的东西虽然拿不回来，但是，忘记的事情是可以想起来的。\n" +
                "生生生生暗生始，死死死死冥死终。\n" +
                "我的小伙伴们都惊呆了！\n" +
                "刁蛮少女贵千金，比武招亲动芳心。盼能与君长相依，结伴江湖侠侣行。\n" +
                "控兄是我的个性的同时，也是勋章！\n" +
                "哭泣并不能改变任何事情。\n" +
                "既不回头，何必不忘；既然无缘，何须誓言；今日种种，似水无痕；明夕何夕，君已陌路。\n" +
                "欺骗世界，欺骗最初的你。\n" +
                "只有破碎的心才有伤人的棱角。\n" +
                "我只对现实世界绝望过，却未对自己绝望过！\n" +
                "从小好女色的男人的想像力比不上狗。\n" +
                "我并不羡慕别人的人生，这就是所谓幸福。\n" +
                "All for one, one for all.\n" +
                "神曲的存在并不是为了享受音乐，而是品味那段最珍贵的回忆。\n" +
                "有些事情本身我们无法控制，只好控制自己。\n" +
                "日子过的象流水一般。它静静的从我们身边缓缓流过，不带半分声响。那些我们当年执着的人，执着的事，执着之后，却变成一种负担。\n" +
                "不要把你所遭遇的苦难看得太大，更不要把你所拥有的幸福看得太少。\n";

        String[] paragraphs = content.split("\\n");

        Random random = new Random();
        int index = random.nextInt(paragraphs.length);

        return paragraphs[index];
    }
}
